In [121]:
import pandas as pd
block = pd.read_clipboard(sep='\t')
block

                                        т/к СП Диксон
0                                         Дисп. 05/02
1                                         1 2305/0800
2                                      2 6445N/04030E
3                                             4 270/3
4                                               5 0/0
5                                        26 2105/1825
6                                              27 ТВА
7                                       31 91,8/142,5
8                                      43 Архангельск
9                                       100 Груза нет
10         2205/1530 Принято с т/х «Водолей-2»: Пр...
11         2205/1610 Принято с т/к «Кама»: ТНС – 1...
12         2205/1645 Принято с т/к «Кама»: ДТ – Л ...
13         2205/1705 Сдано на т/к «Кама»: шлам=21,...

In [122]:
COLUMN_NAMES = [l for l in range(0, 104)]
df = pd.DataFrame(columns=COLUMN_NAMES, index=[0])
df

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [123]:
block.T.reset_index().values[0][0]

'т/к СП Диксон'

In [124]:
list_data = block.T.reset_index().values
list_data[0][0].split()

['т/к', 'СП', 'Диксон']

In [125]:
list_data

array([['т/к СП Диксон', 'Дисп. 05/02', '1 2305/0800', '2 6445N/04030E',
        '4 270/3', '5 0/0', '26 2105/1825', '27 ТВА', '31 91,8/142,5',
        '43 Архангельск', '100 Груза нет',
        '       2205/1530 Принято с т/х «Водолей-2»: Пресная вода = 150 тн',
        '       2205/1610 Принято с т/к «Кама»: ТНС – 180(RME – 180), вид М = 60 тн',
        '       2205/1645 Принято с т/к «Кама»: ДТ – Л – К5 = 40 тн',
        '       2205/1705 Сдано на т/к «Кама»: шлам=21,5 м3, грязное масло=1,4 м3.']],
      dtype=object)

In [126]:
len(list_data[0])

15

In [127]:
for i in range(len(list_data[0])):
    if list_data[0][i].split()[0].isdigit():
        df.iloc[0, int(list_data[0][i].split()[0])] = ' '.join(list_data[0][i].split()[1:][:])
    elif list_data[0][i].split()[0] == 'т/к':
        df.iloc[0, 101] = list_data[0][i][4:]
    elif list_data[0][i].split()[0] == 'Дисп.':
        df.iloc[0, 102] = list_data[0][i][6:]
    else:
        df.iloc[0, 103] = list_data[0][i]

In [128]:
df

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,NaN,2305/0800,6445N/04030E,NaN,270/3,0/0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Груза нет,СП Диксон,05/02,"2205/1705 Сдано на т/к «Кама»: шлам=21,..."

In [129]:
df.dropna(axis=1).info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, 0 to 0
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       1 non-null      object
 1   2       1 non-null      object
 2   4       1 non-null      object
 3   5       1 non-null      object
 4   26      1 non-null      object
 5   27      1 non-null      object
 6   31      1 non-null      object
 7   43      1 non-null      object
 8   100     1 non-null      object
 9   101     1 non-null      object
 10  102     1 non-null      object
 11  103     1 non-null      object
dtypes: object(12)
memory usage: 104.0+ bytes

In [130]:
df.dropna(axis=1)

,1,2,4,5,26,27,31,43,100,101,102,103
0,2305/0800,6445N/04030E,270/3,0/0,2105/1825,ТВА,"91,8/142,5",Архангельск,Груза нет,СП Диксон,05/02,"2205/1705 Сдано на т/к «Кама»: шлам=21,..."

In [141]:
df

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,NaN,2305/0800,6445N/04030E,NaN,270/3,0/0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Груза нет,СП Диксон,05/02,"2205/1705 Сдано на т/к «Кама»: шлам=21,..."

In [136]:
len(df.values.tolist()[0])

104

In [150]:
daily_list = df.values.tolist()[0]

In [151]:
daily_list

[nan,
 '2305/0800',
 '6445N/04030E',
 nan,
 '270/3',
 '0/0',
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 '2105/1825',
 'ТВА',
 nan,
 nan,
 nan,
 '91,8/142,5',
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 'Архангельск',
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 'Груза нет',
 'СП Диксон',
 '05/02',
 '       2205/1705 Сдано на т/к «Кама»: шлам=21,5 м3, грязное масло=1,4 м3.']

In [152]:
pd.DataFrame(daily_list).T

,0,1,2,3,4,5,6,7,8,9,...,94,95,96,97,98,99,100,101,102,103
0,NaN,2305/0800,6445N/04030E,NaN,270/3,0/0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,Груза нет,СП Диксон,05/02,"2205/1705 Сдано на т/к «Кама»: шлам=21,..."